Octopustank/stm32-multifunction-embedded-toy/Core/Src/main.c
        if (cmd == 1) {
            esp_result = ESP8266_Init();
            if (esp_result >= 0) {
                rt_thread_mdelay(2000);
                esp_result = ESP8266_JoinAccessPoint(mqtt_ssid, mqtt_pwd);
            }
            mqtt_connected = (esp_result == 0) ? 1 : -1;
        }
        else if (cmd == 2) {
            esp_result = ESP8266_ConnectToServer(mqtt_broker, mqtt_port);
            if (esp_result >= 0)
                esp_result = ESP8266_MqttUserCfg(mqtt_client, "", "");
            if (esp_result >= 0)
                esp_result = ESP8266_MqttConnect(0, mqtt_broker, mqtt_port, 0);
            mqtt_connected = (esp_result == 0) ? 2 : -2;
        }
        else if (cmd == 3) {
            rt_mutex_take(&sensor_mutex, RT_WAITING_FOREVER);
            struct SensorData local = sensor_data;
            rt_mutex_release(&sensor_mutex);
            char payload[64];
            int t_i = (int)local.temp, t_d = (int)((local.temp - t_i) * 10 + 0.5f);
            int h_i = (int)local.humi, h_d = (int)((local.humi - h_i) * 10 + 0.5f);
            if (t_d >= 10) { t_i++; t_d -= 10; }
            if (h_d >= 10) { h_i++; h_d -= 10; }
            snprintf(payload, sizeof(payload),
                "t=%d.%d h=%d.%d l=%u d=%u",
                t_i, t_d, h_i, h_d, local.light, local.distance);
            uart_puts("\r\n[pub] ");
            uart_puts(payload);
            uart_puts("\r\n");
            esp_result = ESP8266_MqttPub("sensor/data", (uint8_t*)payload, strlen(payload));
        }
        else if (cmd == 4) {
            esp_result = ESP8266_MqttSub(esp_sub_idx, mqtt_topic, 0);
        }
        else if (cmd == 5) {
            esp_result = ESP8266_MqttUnsub(esp_sub_idx, mqtt_topic);
        }
        else if (cmd == 7) {
            esp_result = ESP8266_MqttPub(mqtt_topic, (uint8_t*)"hello", 5);
        }
        else if (cmd == 6) {
#if AUTO_SUB_ECHO
            const char *b = esp_get_buf();
            int len = esp_get_buf_len();
            if (len > 0) {
                char *p = strstr((char*)b, "+MQTTSUBRECV");
                if (p) {
                    char *eol = strpbrk(p, "\r\n");
                    if (eol) {
                        *eol = '\0';
                        char *last = strrchr(p, ',');
                        if (last) {
#if AUTO_SUB_EXEC
                            if (sub_exec) {
                                uart_inject(last + 1);
                                uart_inject("\r\n");
                            } else
#endif
                            if (sub_echo) {
                                uart_puts("\r\n[MQTT] ");
                                uart_puts(last + 1);
                                uart_puts("\r\nrtt> ");
                            }
                        }
                    }
                    esp_clear_buf();
                }
            }
            if (len > 512) esp_clear_buf();
#else
            if (esp_get_buf_len() > 512) esp_clear_buf();
#endif

            if (autopub_enabled && mqtt_connected == 2) {
                rt_tick_t now = rt_tick_get();
                if (now - last_autopub >= rt_tick_from_millisecond(AUTOPUB_INTERVAL_S * 1000UL)) {
                    last_autopub = now;
                    rt_mutex_take(&sensor_mutex, RT_WAITING_FOREVER);
                    struct SensorData local = sensor_data;
                    rt_mutex_release(&sensor_mutex);
                    char payload[64];
                    int t_i = (int)local.temp, t_d = (int)((local.temp - t_i) * 10 + 0.5f);
                    int h_i = (int)local.humi, h_d = (int)((local.humi - h_i) * 10 + 0.5f);
                    if (t_d >= 10) { t_i++; t_d -= 10; }
                    if (h_d >= 10) { h_i++; h_d -= 10; }
                    snprintf(payload, sizeof(payload),
                        "t=%d.%d h=%d.%d l=%u d=%u",
                        t_i, t_d, h_i, h_d, local.light, local.distance);
                    ESP8266_MqttPub("sensor/data", (uint8_t*)payload, strlen(payload));
                }
            }
            continue;  /* don't release done_sem for background check */
        }

        rt_sem_release(&esp_done_sem);
    }
}

/* ---- Game Thread (snake on MAX7219) -------------------------------------- */

static void game_thread_entry(void *param)
{
    const uint8_t smiley[8] = {
        0x00, 0x24, 0x24, 0x00, 0x00, 0x42, 0x3C, 0x00
    };
    static int prev_mode = 1;  /* force initial smiley display on boot */

    while (1) {
        if (!game_mode) {
            if (prev_mode) { max7219_display(smiley); prev_mode = 0; }
            rt_thread_mdelay(100);
            continue;
        }
        prev_mode = game_mode;

        if (game_mode == 1) {
            /* serial input: poll for WASD / arrows / Ctrl+C / Enter */
            if (g_serial_snake) {
                int c;
                while ((c = uart_getc()) >= 0) {
                    if (c == 0x03)      { game_mode = 0; break; }       /* Ctrl+C */
                    if (c == '\r' || c == '\n') { game_mode = 0; break; }
                    if (c == 'w' || c == 'W') g_dir = DIR_UP;
                    if (c == 's' || c == 'S') g_dir = DIR_DOWN;
                    if (c == 'a' || c == 'A') g_dir = DIR_LEFT;
                    if (c == 'd' || c == 'D') g_dir = DIR_RIGHT;
                }
                if (!game_mode) { g_serial_snake = 0; continue; }
            }

            snake_tick(g_dir);
            g_dir = DIR_NONE;

            uint8_t rows[8];
            snake_get_display(rows);
            max7219_display(rows);

            if (snake_is_dead()) game_mode = 2;
            rt_thread_mdelay(snake_get_speed_ms());
            continue;
        }

        if (game_mode == 2) {
            const uint8_t all[8]  = {0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF,0xFF};
            const uint8_t none[8] = {0,0,0,0,0,0,0,0};
            int i;
            for (i = 0; i < 3 && game_mode == 2; i++) {
                max7219_display(all);  rt_thread_mdelay(150);
                if (game_mode != 2) break;
                max7219_display(none); rt_thread_mdelay(150);
            }
            if (i >= 3) game_mode = 0;  /* auto-exit after 3 blinks */
            continue;
        }
    }
}

/* ---- Application Entry --------------------------------------------------- */
int main(void)
{
    MX_GPIO_Init();
    MX_I2C1_Init();
    ssd1306_Init(&hi2c1);
    MX_ADC1_Init();
    MX_USART2_UART_Init();
    MX_USART1_UART_Init();
    max7219_init();

    /* SR04 Trig pin (PB6): output push-pull */
    {
        GPIO_InitTypeDef s = {0};
        s.Pin   = TRIG_Pin;
        s.Mode  = GPIO_MODE_OUTPUT_PP;
        s.Pull  = GPIO_NOPULL;
        s.Speed = GPIO_SPEED_FREQ_HIGH;
        HAL_GPIO_Init(TRIG_GPIO_Port, &s);
        HAL_GPIO_WritePin(TRIG_GPIO_Port, TRIG_Pin, GPIO_PIN_RESET);
    }

